SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_syscfg.h
/**
  * @brief SYSCFG_DMARMP Register Bit Definition
  */
#define  SYSCFG_DMARMP_TIM1_TRIG_RMP_Pos          (0)
#define  SYSCFG_DMARMP_TIM1_TRIG_RMP_Msk          (0x1U << SYSCFG_DMARMP_TIM1_TRIG_RMP_Pos)         /*!<*/
#define  SYSCFG_DMARMP_TIM1_TRIG_RMP              SYSCFG_DMARMP_TIM1_TRIG_RMP_Msk
#define  SYSCFG_DMARMP_TIM1_COM_RMP_Pos           (1)
#define  SYSCFG_DMARMP_TIM1_COM_RMP_Msk           (0x1U << SYSCFG_DMARMP_TIM1_COM_RMP_Pos)          /*!<*/
#define  SYSCFG_DMARMP_TIM1_COM_RMP               SYSCFG_DMARMP_TIM1_COM_RMP_Msk
#define  SYSCFG_DMARMP_TIM2_UP_RMP_Pos            (2)
#define  SYSCFG_DMARMP_TIM2_UP_RMP_Msk            (0x3U << SYSCFG_DMARMP_TIM2_UP_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_TIM2_UP_RMP                SYSCFG_DMARMP_TIM2_UP_RMP_Msk
#define  SYSCFG_DMARMP_TIM2_UP_RMP_Bit0           (0x1U << SYSCFG_DMARMP_TIM2_UP_RMP_Pos) 
#define  SYSCFG_DMARMP_TIM2_UP_RMP_Bit1           (0x2U << SYSCFG_DMARMP_TIM2_UP_RMP_Pos) 
#define  SYSCFG_DMARMP_TIM2_CC3_RMP_Pos           (4)
#define  SYSCFG_DMARMP_TIM2_CC3_RMP_Msk           (0x1U << SYSCFG_DMARMP_TIM2_CC3_RMP_Pos)          /*!<*/
#define  SYSCFG_DMARMP_TIM2_CC3_RMP               SYSCFG_DMARMP_TIM2_CC3_RMP_Msk
#define  SYSCFG_DMARMP_TIM2_CC4_RMP_Pos           (5)
#define  SYSCFG_DMARMP_TIM2_CC4_RMP_Msk           (0x1U << SYSCFG_DMARMP_TIM2_CC4_RMP_Pos)          /*!<*/
#define  SYSCFG_DMARMP_TIM2_CC4_RMP               SYSCFG_DMARMP_TIM2_CC4_RMP_Msk
#define  SYSCFG_DMARMP_TIM5_UP_RMP_Pos            (8)
#define  SYSCFG_DMARMP_TIM5_UP_RMP_Msk            (0x1U << SYSCFG_DMARMP_TIM5_UP_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_TIM5_UP_RMP                SYSCFG_DMARMP_TIM5_UP_RMP_Msk
#define  SYSCFG_DMARMP_TIM6_UP_RMP_Pos            (10)
#define  SYSCFG_DMARMP_TIM6_UP_RMP_Msk            (0x1U << SYSCFG_DMARMP_TIM6_UP_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_TIM6_UP_RMP                SYSCFG_DMARMP_TIM6_UP_RMP_Msk
#define  SYSCFG_DMARMP_TIM7_UP_RMP_Pos            (12)
#define  SYSCFG_DMARMP_TIM7_UP_RMP_Msk            (0x1U << SYSCFG_DMARMP_TIM7_UP_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_TIM7_UP_RMP                SYSCFG_DMARMP_TIM7_UP_RMP_Msk
#define  SYSCFG_DMARMP_TIM8_TRIG_RMP_Pos          (13)
#define  SYSCFG_DMARMP_TIM8_TRIG_RMP_Msk          (0x1U << SYSCFG_DMARMP_TIM8_TRIG_RMP_Pos)         /*!<*/
#define  SYSCFG_DMARMP_TIM8_TRIG_RMP              SYSCFG_DMARMP_TIM8_TRIG_RMP_Msk
#define  SYSCFG_DMARMP_TIM8_UP_RMP_Pos            (14)
#define  SYSCFG_DMARMP_TIM8_UP_RMP_Msk            (0x1U << SYSCFG_DMARMP_TIM8_UP_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_TIM8_UP_RMP                SYSCFG_DMARMP_TIM8_UP_RMP_Msk
#define  SYSCFG_DMARMP_TIM8_COM_RMP_Pos           (15)
#define  SYSCFG_DMARMP_TIM8_COM_RMP_Msk           (0x1U << SYSCFG_DMARMP_TIM8_COM_RMP_Pos)          /*!<*/
#define  SYSCFG_DMARMP_TIM8_COM_RMP               SYSCFG_DMARMP_TIM8_COM_RMP_Msk
#define  SYSCFG_DMARMP_USART4_RX_RMP_Pos          (16)
#define  SYSCFG_DMARMP_USART4_RX_RMP_Msk          (0x1U << SYSCFG_DMARMP_USART4_RX_RMP_Pos)         /*!<*/
#define  SYSCFG_DMARMP_USART4_RX_RMP              SYSCFG_DMARMP_USART4_RX_RMP_Msk
#define  SYSCFG_DMARMP_USART4_TX_RMP_Pos          (17)
#define  SYSCFG_DMARMP_USART4_TX_RMP_Msk          (0x1U << SYSCFG_DMARMP_USART4_TX_RMP_Pos)         /*!<*/
#define  SYSCFG_DMARMP_USART4_TX_RMP              SYSCFG_DMARMP_USART4_TX_RMP_Msk
#define  SYSCFG_DMARMP_DAC_CH2_RMP_Pos            (27)
#define  SYSCFG_DMARMP_DAC_CH2_RMP_Msk            (0x1U << SYSCFG_DMARMP_DAC_CH2_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_DAC_CH2_RMP                SYSCFG_DMARMP_DAC_CH2_RMP_Msk
#define  SYSCFG_DMARMP_DAC_CH1_RMP_Pos            (28)
#define  SYSCFG_DMARMP_DAC_CH1_RMP_Msk            (0x1U << SYSCFG_DMARMP_DAC_CH1_RMP_Pos)           /*!<*/
#define  SYSCFG_DMARMP_DAC_CH1_RMP                SYSCFG_DMARMP_DAC_CH1_RMP_Msk
#define  SYSCFG_DMARMP_ADC3_RMP_Pos               (29)
#define  SYSCFG_DMARMP_ADC3_RMP_Msk               (0x1U << SYSCFG_DMARMP_ADC3_RMP_Pos)              /*!<*/
#define  SYSCFG_DMARMP_ADC3_RMP                   SYSCFG_DMARMP_ADC3_RMP_Msk
#define  SYSCFG_DMARMP_ADC1_RMP_Pos               (30)
#define  SYSCFG_DMARMP_ADC1_RMP_Msk               (0x1U << SYSCFG_DMARMP_ADC1_RMP_Pos)              /*!<*/
#define  SYSCFG_DMARMP_ADC1_RMP                   SYSCFG_DMARMP_ADC1_RMP_Msk
#define  SYSCFG_DMARMP_ADC2_RMP_Pos               (31)
#define  SYSCFG_DMARMP_ADC2_RMP_Msk               (0x1U << SYSCFG_DMARMP_ADC2_RMP_Pos)              /*!<*/
#define  SYSCFG_DMARMP_ADC2_RMP                   SYSCFG_DMARMP_ADC2_RMP_Msk

/**
  * @brief SYSCFG_BUS_PRI Register Bit Definition
  */
#define  SYSCFG_BUS_PRI_PRI_M1_Pos                (0)
#define  SYSCFG_BUS_PRI_PRI_M1_Msk                (0x7U << SYSCFG_BUS_PRI_PRI_M1_Pos)               /*!<*/
#define  SYSCFG_BUS_PRI_PRI_M1                    SYSCFG_BUS_PRI_PRI_M1_Msk
#define  SYSCFG_BUS_PRI_PRI_M1_Bit0               (0x1U << SYSCFG_BUS_PRI_PRI_M1_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M1_Bit1               (0x2U << SYSCFG_BUS_PRI_PRI_M1_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M1_Bit2               (0x4U << SYSCFG_BUS_PRI_PRI_M1_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M2_Pos                (3)
#define  SYSCFG_BUS_PRI_PRI_M2_Msk                (0x7U << SYSCFG_BUS_PRI_PRI_M2_Pos)               /*!<*/
#define  SYSCFG_BUS_PRI_PRI_M2                    SYSCFG_BUS_PRI_PRI_M2_Msk
#define  SYSCFG_BUS_PRI_PRI_M2_Bit0               (0x1U << SYSCFG_BUS_PRI_PRI_M2_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M2_Bit1               (0x2U << SYSCFG_BUS_PRI_PRI_M2_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M2_Bit2               (0x4U << SYSCFG_BUS_PRI_PRI_M2_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M3_Pos                (6)
#define  SYSCFG_BUS_PRI_PRI_M3_Msk                (0x7U << SYSCFG_BUS_PRI_PRI_M3_Pos)               /*!<*/
#define  SYSCFG_BUS_PRI_PRI_M3                    SYSCFG_BUS_PRI_PRI_M3_Msk
#define  SYSCFG_BUS_PRI_PRI_M3_Bit0               (0x1U << SYSCFG_BUS_PRI_PRI_M3_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M3_Bit1               (0x2U << SYSCFG_BUS_PRI_PRI_M3_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M3_Bit2               (0x4U << SYSCFG_BUS_PRI_PRI_M3_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M4_Pos                (9)
#define  SYSCFG_BUS_PRI_PRI_M4_Msk                (0x7U << SYSCFG_BUS_PRI_PRI_M4_Pos)               /*!<*/
#define  SYSCFG_BUS_PRI_PRI_M4                    SYSCFG_BUS_PRI_PRI_M4_Msk
#define  SYSCFG_BUS_PRI_PRI_M4_Bit0               (0x1U << SYSCFG_BUS_PRI_PRI_M4_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M4_Bit1               (0x2U << SYSCFG_BUS_PRI_PRI_M4_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M4_Bit2               (0x4U << SYSCFG_BUS_PRI_PRI_M4_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M5_Pos                (12)
#define  SYSCFG_BUS_PRI_PRI_M5_Msk                (0x7U << SYSCFG_BUS_PRI_PRI_M5_Pos)               /*!<*/
#define  SYSCFG_BUS_PRI_PRI_M5                    SYSCFG_BUS_PRI_PRI_M5_Msk
#define  SYSCFG_BUS_PRI_PRI_M5_Bit0               (0x1U << SYSCFG_BUS_PRI_PRI_M5_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M5_Bit1               (0x2U << SYSCFG_BUS_PRI_PRI_M5_Pos) 
#define  SYSCFG_BUS_PRI_PRI_M5_Bit2               (0x4U << SYSCFG_BUS_PRI_PRI_M5_Pos) 

/**
  * @brief SYSCFG_LP_CFGR1 Register Bit Definition
  */
#define  SYSCFG_LP_CFGR1_SRAM1_P0_PSD_Pos         (0)
#define  SYSCFG_LP_CFGR1_SRAM1_P0_PSD_Msk         (0x1U << SYSCFG_LP_CFGR1_SRAM1_P0_PSD_Pos)        /*!<*/
#define  SYSCFG_LP_CFGR1_SRAM1_P0_PSD             SYSCFG_LP_CFGR1_SRAM1_P0_PSD_Msk
#define  SYSCFG_LP_CFGR1_SRAM1_P1_PSD_Pos         (1)
#define  SYSCFG_LP_CFGR1_SRAM1_P1_PSD_Msk         (0x1U << SYSCFG_LP_CFGR1_SRAM1_P1_PSD_Pos)        /*!<*/
#define  SYSCFG_LP_CFGR1_SRAM1_P1_PSD             SYSCFG_LP_CFGR1_SRAM1_P1_PSD_Msk
#define  SYSCFG_LP_CFGR1_SRAM2_P0_PSD_Pos         (2)
#define  SYSCFG_LP_CFGR1_SRAM2_P0_PSD_Msk         (0x1U << SYSCFG_LP_CFGR1_SRAM2_P0_PSD_Pos)        /*!<*/
#define  SYSCFG_LP_CFGR1_SRAM2_P0_PSD             SYSCFG_LP_CFGR1_SRAM2_P0_PSD_Msk
#define  SYSCFG_LP_CFGR1_SRAM2_P1_PSD_Pos         (3)
#define  SYSCFG_LP_CFGR1_SRAM2_P1_PSD_Msk         (0x1U << SYSCFG_LP_CFGR1_SRAM2_P1_PSD_Pos)        /*!<*/
#define  SYSCFG_LP_CFGR1_SRAM2_P1_PSD             SYSCFG_LP_CFGR1_SRAM2_P1_PSD_Msk
#define  SYSCFG_LP_CFGR1_CACHE_MEM_PSD_Pos        (7)
#define  SYSCFG_LP_CFGR1_CACHE_MEM_PSD_Msk        (0x1U << SYSCFG_LP_CFGR1_CACHE_MEM_PSD_Pos)       /*!<*/
#define  SYSCFG_LP_CFGR1_CACHE_MEM_PSD            SYSCFG_LP_CFGR1_CACHE_MEM_PSD_Msk
#define  SYSCFG_LP_CFGR1_FCAN1_MEM_PSD_Pos        (8)
#define  SYSCFG_LP_CFGR1_FCAN1_MEM_PSD_Msk        (0x1U << SYSCFG_LP_CFGR1_FCAN1_MEM_PSD_Pos)       /*!<*/
#define  SYSCFG_LP_CFGR1_FCAN1_MEM_PSD            SYSCFG_LP_CFGR1_FCAN1_MEM_PSD_Msk
#define  SYSCFG_LP_CFGR1_FCAN2_MEM_PSD_Pos        (9)
#define  SYSCFG_LP_CFGR1_FCAN2_MEM_PSD_Msk        (0x1U << SYSCFG_LP_CFGR1_FCAN2_MEM_PSD_Pos)       /*!<*/
#define  SYSCFG_LP_CFGR1_FCAN2_MEM_PSD            SYSCFG_LP_CFGR1_FCAN2_MEM_PSD_Msk
#define  SYSCFG_LP_CFGR1_KEY_Pos                  (15)
#define  SYSCFG_LP_CFGR1_KEY_Msk                  (0x1FFFFU << SYSCFG_LP_CFGR1_KEY_Pos)             /*!<*/
#define  SYSCFG_LP_CFGR1_KEY                      SYSCFG_LP_CFGR1_KEY_Msk
#define  SYSCFG_LP_CFGR1_KEY_Bit0                 (0x00001U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit1                 (0x00002U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit2                 (0x00004U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit3                 (0x00008U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit4                 (0x00010U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit5                 (0x00020U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit6                 (0x00040U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit7                 (0x00080U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit8                 (0x00100U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit9                 (0x00200U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit10                (0x00400U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit11                (0x00800U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit12                (0x01000U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit13                (0x02000U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit14                (0x04000U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit15                (0x08000U << SYSCFG_LP_CFGR1_KEY_Pos) 
#define  SYSCFG_LP_CFGR1_KEY_Bit16                (0x10000U << SYSCFG_LP_CFGR1_KEY_Pos) 

/**
  * @brief SYSCFG_TEST Register Bit Definition
  */
#define  SYSCFG_TEST_ANA_DUMMY_Pos                (0)
#define  SYSCFG_TEST_ANA_DUMMY_Msk                (0xFFU << SYSCFG_TEST_ANA_DUMMY_Pos)              /*!<*/
#define  SYSCFG_TEST_ANA_DUMMY                    SYSCFG_TEST_ANA_DUMMY_Msk
#define  SYSCFG_TEST_ANA_DUMMY_Bit0               (0x01U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit1               (0x02U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit2               (0x04U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit3               (0x08U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit4               (0x10U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit5               (0x20U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit6               (0x40U << SYSCFG_TEST_ANA_DUMMY_Pos) 
#define  SYSCFG_TEST_ANA_DUMMY_Bit7               (0x80U << SYSCFG_TEST_ANA_DUMMY_Pos) 


#endif

